function clockString(ms) {
  let h = Math.floor(ms / 3600000);
  let m = Math.floor(ms % 3600000 / 60000);
  let s = Math.floor(ms % 60000 / 1000);
  return [h, m, s].map(v => v.toString().padStart(2, '0')).join(':');
}

import pkg from '@whiskeysockets/baileys';
const { generateWAMessageFromContent, proto, prepareWAMessageMedia } = pkg;

const handler = async (m, {conn, usedPrefix, usedPrefix: _p, __dirname, text, isPrems}) => {
  let d = new Date(new Date + 3600000);
  let locale = 'ar';
  let week = d.toLocaleDateString(locale, { weekday: 'long' });
  let date = d.toLocaleDateString(locale, { day: 'numeric', month: 'long', year: 'numeric' });
  let _uptime = process.uptime() * 1000;
  let uptime = clockString(_uptime);
  let user = global.db.data.users[m.sender];
  let name = conn.getName(m.sender)
  let { money, joincount } = global.db.data.users[m.sender];
  let { exp, limit, level, role } = global.db.data.users[m.sender];
  let rtotalreg = Object.values(global.db.data.users).filter(user => user.registered == true).length;
  let more = String.fromCharCode(8206);
  let readMore = more.repeat(850);
  let who = m.mentionedJid && m.mentionedJid[0] ? m.mentionedJid[0] : m.fromMe ? conn.user.jid : m.sender
  let taguser = '@' + m.sender.split("@s.whatsapp.net")[0];
await conn.sendMessage(m.chat'💝', { react: { text: '📂', key: m.key } })
const PLUTO = 'https://telegra.ph/file/5fc26caa7580823ce9dda.jpg'
const mentionId = m.key.participant || m.key.remoteJid;

conn.relayMessage(m.chat, { viewOnceMessage: { message: { interactiveMessage: { header: { title: `gataVidMenu`}, body: { text: `*• ──╾⊱﹝⚡️﹞⊰╼── •*
*مــرحــبــا بــك/ي* @${mentionId.split('@')[0]}
╗──────¤مــعلـ🛖ـومــاتــك
> •مــســتــواك : ${level}
> •بــريــمــيــوم : ${user.premiumTime > 0 ? 'مــمـ🔱ـيز' : (isPrems ? 'مــمـ🔱ـيز' : 'عــ🍁ــادي') || ''}
> •رتــبــتــك : ${role}
*• ──╾⊱﹝⚡️﹞⊰╼── •*
╗───¤مــعلــومــات الــ🤖بــوت
> إســم الــبــوت:OBITO 
> •الــمــطــور :LUFFY/ SHADOW 
> •مــدة الــتــشــغــيل : ${24:00 ساعه}
*• ──╾⊱﹝⚡️﹞⊰╼── •*
*~⌬ تــ✍︎ــوقــيــع ↡~*🖋️
*> OBITO ﹝⚡️﹞LB
*• ──╾⊱﹝⚡️﹞⊰╼── •*
> Copyright © 2024 Obito`,subtitle: "OBITO",},header: { hasMediaAttachment: true,...(await prepareWAMessageMedia({ image : { url: OBITO } }, { upload: conn.waUploadToServer }, {quoted: m}))},
                  contextInfo: {
                      mentionedJid: [m.sender],
                      isForwarded: false,
                  },nativeFlowMessage: { buttons: [


                          {
                              name: 'single_select',
                              buttonParamsJson: JSON.stringify({
                                  title: '⌈🛡╎القـــــســام ╎🛡⌋',
                                  sections: [
                                      {
                                          title: 'مــرحـ🛡ـبــا بــك فـي مــ☑هــام اوبيتو بـ🤖ـوت',
                                          highlight_label: 'اقــرأ اوامــر يــا بــرو 🤖',
                                          rows : [
                                              {
                                                  header: 'الــقـ👑ـســم الـاول',
                                                  title: 'قسم_اعضاء  #الاعضاء',
                                                  description: '> ˼⚕️˹↜ قــســم الـمـجـمـوعـات الـاعـضـاء ↶
╮──────────────────⟢ـ 
┊˼🍂˹┊⟣｢.احصائيات ｣
┊˼🍂˹┊⟣｢.المـطـوࢪ｣
┊˼🍂˹┊⟣｢.القـوانـيـن｣
┊˼🍂˹┊⟣｢.الـدعـم｣
┊˼🍂˹┊⟣｢.اقـتـࢪاح｣
┊˼🍂˹┊⟣｢.ابـلاغ｣
┊˼🍂˹┊⟣｢.تـقـيـم｣
┊˼🍂˹┊⟣｢.اب تـايـم｣
┊˼🍂˹┊⟣｢.صـلـح｣
┊˼🍂˹┊⟣｢.اڪـتـبـهـا｣
┊˼🍂˹┊⟣｢.حـفـظ｣
┊˼🍂˹┊⟣｢.لـقـب｣
┊˼🍂˹┊⟣｢.لـقـبـي｣
┊˼🍂˹┊⟣｢.لـقـبـنـي｣
┊˼🍂˹┊⟣｢.حـذف-لـقـب｣
┊˼🍂˹┊⟣｢.الـالـقـاب｣
┊˼🍂˹┊⟣｢.المتـصـلـيـن｣
┊˼🍂˹┊⟣｢.الـجـࢪوب｣
┊˼🍂˹┊⟣｢.مـخـفـي｣
┊˼🍂˹┊⟣｢.مـنـشـن｣
┊˼🍂˹┊⟣｢.الـاصـنـام｣
┊˼🍂˹┊⟣｢.الـادمـن｣
┊˼🍂˹┊⟣｢.ࢪسـتـࢪ｣
┊˼🍂˹┊⟣｢.لـيـنـك｣
┊˼🍂˹┊⟣｢.تـࢪقـيـه｣
┊˼🍂˹┊⟣｢.خـفـض｣
┊˼🍂˹┊⟣｢.الـوصـف｣
┊˼🍂˹┊⟣｢.الـتـࢪحـيـب｣
┊˼🍂˹┊⟣｢.الـوداع｣
┊˼🍂˹┊⟣｢.الـاسـم｣
┊˼🍂˹┊⟣｢.دعــوه｣
┊˼🍂˹┊⟣｢.حـذف｣
┊˼🍂˹┊⟣｢.جـࢪوب فـتـح｣
┊˼🍂˹┊⟣｢.جـࢪوب قـفـل｣
┊˼🍂˹┊⟣｢.اضـافـه ｣
┊˼🍂˹┊⟣｢.طـࢪد｣
┊˼🍂˹┊⟣｢.تـصـفـيـه｣
┊˼🍂˹┊⟣｢.اࢪقـام｣
┊˼🍂˹┊⟣｢.انـذاࢪ｣
┊˼🍂˹┊⟣｢.اعـفــاء｣
┊˼🍂˹┊⟣｢.الـانـذاࢪات｣
┊˼🍂˹┊⟣｢.شـࢪح_الـتذڪـيـر｣
┊˼🍂˹┊⟣｢.حـذف_الـتذڪـيـࢪ｣
┊˼🍂˹┊⟣｢.قـائـمـه_الـتذڪـيـࢪات｣
┊˼🍂˹┊⟣｢.تذكير_بعد｣
╯──────────────────⟢ـ
                                                id: '.م1'
                                              },
                                              {
                                                  header: 'الــقـ👨🏻‍💻ـســم الــثــانــي',
                                                  title: 'اقسم_المشرفين #المشرفين',
                                                  description: '',
                                                  id: '.2م' 
                                              },
                                              {
                                                  header: 'الــقـ🕋ـســم الــثــالــث',
                                                  title: 'قسم_الدين #الدين',
                                                  description: '',
                                                  id: '.3م'
                                              },
                                              {
                                                  header: 'الــقـ👑ـســم الــرابــع',
                                                  title: 'قسم_المطور #المطور',
                                                  description: '> ˼⚡️˹↜ قــســم المـطـوࢪ  ↶
╮────────────────⟢ـ
┊˼➕˹┊⟣｢.انـشـئ｣
┊˼💁🏻‍♂️˹┊⟣｢.لـمـسـتـخـدم｣
┊˼⚜️˹┊⟣｢.لـنـخـبـه｣
┊˼💎˹┊⟣｢.ضيف_الماس｣
┊˼⚡˹┊⟣｢.اڪـسـبـي｣
┊˼💸˹┊⟣｢.ضيف_فلوس｣
┊˼🧋˹┊⟣｢.خصم_خبرة｣
┊˼🔄˹┊⟣｢.ريستارت｣
┊˼👑˹┊⟣｢.ادمـن｣
┊˼🚫˹┊⟣｢.خـاص｣
┊˼⭕˹┊⟣｢.عـام｣
┊˼⛔˹┊⟣｢.المـحـظـوࢪيـن｣
┊˼🛑˹┊⟣｢.بـان｣
┊˼🔘˹┊⟣｢.انـبـان｣
┊˼📵˹┊⟣｢.بـلـوڪ ｣
┊˼✔️˹┊⟣｢.انـبـلـوڪ｣
┊˼📛˹┊⟣｢.الـبـلـوڪـات｣
┊˼🎗️˹┊⟣｢.اعـلان｣
┊˼⌨️˹┊⟣｢.سكراب｣
┊˼📁˹┊⟣｢.مـلـف｣
┊˼👋🏻˹┊⟣｢.اطـࢪد｣
┊˼💠˹┊⟣｢.اخـࢪج｣
┊˼🔮˹┊⟣｢.لـبـࢪوفـايـل｣
┊˼💬˹┊⟣｢.اعادة_تعيين_الرسائل_لكل_المستخدمين｣
╯────────────────⟢',
                                                  id: '.4م'
                                              },
                                              {
                                                  header: 'الــقـ🛡ـســم الــخــامــس',
                                                  title: 'قسم_التنزيلات #التنزيلات',
                                                  description: '',
                                                  id: '.5م'
                                              },
                                              {
                                                  header: 'الــقـ🕹ـســم الــســادس',
                                                  title: 'قسم_الالعاب #الالعاب',
                                                  description: '',
                                                  id: '.6م'
                                              },
                                              {
                                                  header: 'الــقـ🌀ـســم الــســابــع',
                                                  title: 'قسم_التحويلات #التحويلات',
                                                  description: '> ˼🔥˹↜ قــســم  الـتـحـويـلات↶
╮──────────────────⟢ـ 
┊˼🔥˹┊⟣｢.لانمي｣
┊˼🔥˹┊⟣｢.لكرتون｣
┊˼🔥˹┊⟣｢.لتـلـيـجـࢪاف｣
┊˼🔥˹┊⟣｢.لرابط｣
┊˼🔥˹┊⟣｢.لـفـيـديـو｣
┊˼🔥˹┊⟣｢.لصـوࢪه｣
┊˼🔥˹┊⟣｢.لصـوت｣
┊˼🔥˹┊⟣｢.لࢪيـڪـوࢪد｣
┊˼🔥˹┊⟣｢.لـمـتـحـࢪڪ｣
┊˼🔥˹┊⟣｢.لـبـڪـسـل｣
┊˼🔥˹┊⟣｢.لـبـلـوࢪ｣
┊˼🔥˹┊⟣｢.اسـتـيـڪـر｣
┊˼🔥˹┊⟣｢.نـࢪد｣
┊˼🔥˹┊⟣｢.دمـج｣
┊˼🔥˹┊⟣｢.اسـتـڪ｣
┊˼🔥˹┊⟣｢.دائـࢪي｣
┊˼🔥˹┊⟣｢.مـلـصـق｣
┊˼🔥˹┊⟣｢.تـلـيـجـࢪام｣
┊˼🔥˹┊⟣｢.سـࢪقـه｣
┊˼🔥˹┊⟣｢.ســتـڪ｣
┊˼🔥˹┊⟣｢.عـمـيـق｣
┊˼🔥˹┊⟣｢.2عـمـيـق ｣
┊˼🔥˹┊⟣｢.مـنـفـوخ｣
┊˼🔥˹┊⟣｢.صـاخـب｣
┊˼🔥˹┊⟣｢.سـࢪيـع｣
┊˼🔥˹┊⟣｢.عكس｣
┊˼🔥˹┊⟣｢.بـطـئ｣
┊˼🔥˹┊⟣｢.سـلـس｣
┊˼🔥˹┊⟣｢.ࢪوبـوت｣
┊˼🔥˹┊⟣｢.نـيـت ڪـوࢪ｣
┊˼🔥˹┊⟣｢.تـخـيـن｣
┊˼🔥˹┊⟣｢.سـنـجـاب ｣
╯──────────────────⟢ـ',
                                                  id: '.م7'
                                              },
                                              {
                                                  header: 'الــقـ🎧ـســم الــثــامـن',
                                                  title: 'قسم_الصوتيات #الصوتيات',
                                                  description: '',
                                                  id: '.م8'
                                              },
                                              {
                                                  header: 'الــقـ🤖ـســم الــتــاســع',
                                                  title: 'قسم_الذكاء #الذكاء',
                                                  description: '> ˼⚡️˹↜ قــســم الـذڪـاء الـاصـطـنـاعـي  ↶
╮──────────────────⟢ـ 
┊˼🤖˹┊⟣｢.هيفن｣
┊˼🤖˹┊⟣｢.نيون｣
┊˼🤖˹┊⟣｢.كاكاشي｣
┊˼🤖˹┊⟣｢.زاو_فان｣
┊˼🤖˹┊⟣｢.ماكيما｣
┊˼🤖˹┊⟣｢.غوجو｣
┊˼🤖˹┊⟣｢.سونغ｣
┊˼🤖˹┊⟣｢.بيني｣
┊˼🤖˹┊⟣｢.سكاي｣
┊˼🤖˹┊⟣｢.اينديفار｣
┊˼🤖˹┊⟣｢.ماش｣
┊˼🤖˹┊⟣｢.موزان｣
┊˼🤖˹┊⟣｢.يوريتشي｣
┊˼🤖˹┊⟣｢.كايدو｣
┊˼🤖˹┊⟣｢.ميلوداس｣
┊˼🤖˹┊⟣｢.إليزابيث｣
┊˼🤖˹┊⟣｢.نامي｣
┊˼🤖˹┊⟣｢.ميكاسا｣
┊˼🤖˹┊⟣｢.ايتاتشي｣
┊˼🤖˹┊⟣｢.روجر｣
┊˼🤖˹┊⟣｢.اسكانور｣
┊˼🤖˹┊⟣｢.كيلوا｣
┊˼🤖˹┊⟣｢.زورو｣
┊˼🤖˹┊⟣｢.ليفاي｣
┊˼🤖˹┊⟣｢.تانجيرو｣
┊˼🤖˹┊⟣｢.روبين｣
┊˼🤖˹┊⟣｢.هانكوك｣
┊˼🤖˹┊⟣｢.هيستوريا｣
┊˼🤖˹┊⟣｢.ماو_ماو｣
┊˼🤖˹┊⟣｢.فريرن｣
┊˼🤖˹┊⟣｢.كوشينا｣
┊˼🤖˹┊⟣｢.هيناتا｣
┊˼🤖˹┊⟣｢.أنيا｣
┊˼🤖˹┊⟣｢.ميتسوري｣
┊˼🤖˹┊⟣｢.سيلفي｣
┊˼🤖˹┊⟣｢.سمسم｣
┊˼🤖˹┊⟣｢.تيسيا｣
┊˼🤖˹┊⟣｢.بلاك｣
┊˼🤖˹┊⟣｢.اني｣
┊˼🤖˹┊⟣｢.لوفي｣
┊˼🤖˹┊⟣｢.ارثر｣
┊˼🤖˹┊⟣｢.شادو｣
┊˼🤖˹┊⟣｢.اوبيتو｣
┊˼🤖˹┊⟣｢.مـاࢪي｣
┊˼🤖˹┊⟣｢.داࢪک｣
┊˼🤖˹┊⟣｢.دحيح｣
┊˼🤖˹┊⟣｢.تحدث｣
┊˼🏞️˹┊⟣｢.اࢪسـم｣
┊˼🎇˹┊⟣｢.لوغو｣
┊˼🎇˹┊⟣｢.لـوغـو 1｣
┊˼🎇˹┊⟣｢.لـوغـو 2｣
┊˼🎇˹┊⟣｢.لـوغـو 3｣
┊˼🎇˹┊⟣｢.لـوغـو 4｣
┊˼🎇˹┊⟣｢.لـوغـو 5｣
┊˼🎇˹┊⟣｢.لـوغـو 6｣
┊˼🌌˹┊⟣｢.تـصـمـيـم 1｣
┊˼🎇˹┊⟣｢.تـصـمـيـم 2｣
╯──────────────────⟢',
                                                  id: '.م9'
                                              },
                                              {
                                                  header: 'الــقـ🚨ـســم الــعــاشــر',
                                                  title: 'قسم_الدعم #الدعم',
                                                  description: '',
                                                  id: '.م10'
                                              },
                                              {
                                                  header: 'الــقـ🔍ـســم �لــحــاديــة عــشــر',
                                                  title: 'قسم_ابحث #البحث',
                                                  description: '',
                                                  id: '.م11'
                                              },
                                              {
                                                  header: 'الــقـ📽️ـســم الــثــانــي عــشــر',
                                                  title: 'قسم_الافلام #الافلام',
                                                  description: '',
                                                  id: '.م12'
                                              },
                                              {
                                                  header: 'الــقـ👨🏻‍💻ـســم الــثــالــث عــشــر',
                                                  title: '',
                                                  description: '',
                                                  id: '.م13'
                                             }
                                            {
                                      header: 'الــقـ👨🏻‍💻ـســم الــرابــع عــشــر',
                                                  title: '',
                                                  description: '> ˼🏛˹↜ قــســم الـبـنـک ↶
╮──────────────────⟢ـ 
┊˼🏛˹┊⟣｢.راتب｣
┊˼🏛˹┊⟣｢.عجله｣
┊˼🏛˹┊⟣｢.تداول｣
┊˼🏛˹┊⟣｢.ࢪهـان｣
┊˼🏛˹┊⟣｢.حـظ｣
┊˼🏛˹┊⟣｢.الماس｣
┊˼🏛˹┊⟣｢.صـحـه｣
┊˼🏛˹┊⟣｢.هـديـه｣
┊˼🏛˹┊⟣｢.ڪـشـف｣
┊˼🏛˹┊⟣｢.لـفــل｣
┊˼🏛˹┊⟣｢.الـاغـنـي｣
┊˼🏛˹┊⟣｢.غـابـه｣
┊˼🏛˹┊⟣｢.مـغـامـࢪه｣
┊˼🏛˹┊⟣｢.يـومـي｣
┊˼🏛˹┊⟣｢.اسـبـوعـي｣
┊˼🏛˹┊⟣｢.بـڪـج｣
┊˼🏛˹┊⟣｢.بـقـشـيـش｣
┊˼🏛˹┊⟣｢.عـمـل｣
┊˼🏛˹┊⟣｢.زࢪف｣
┊˼🏛˹┊⟣｢.بـࢪوفـايـل｣
┊˼🏛˹┊⟣｢.عـمـلات｣
┊˼🏛˹┊⟣｢.عـمـلاتـي｣
┊˼🏛˹┊⟣｢.مـحـفـظـه｣
┊˼🏛˹┊⟣｢.تـسـجـيل｣
┊˼🏛˹┊⟣｢.ايـدي｣
┊˼🏛˹┊⟣｢.تـࢪک｣
┊˼🏛˹┊⟣｢.رسائل｣
┊˼🏛˹┊⟣｢.رسائل_المجموعة｣
┊˼🏛˹┊⟣｢.اعادة_تعيين_رسائلي｣
┊˼🏛˹┊⟣｢.اعادة_تعيين_رسائل_المجموعة｣
╯──────────────────⟢ـ',
                                                  id: '.م14'
                                            }
                                            {
                              ),
                messageParamsJson: ''
              },
              {
    
            name: "quick_reply",
            buttonParamsJson: '{"display_text":"⌈🚀╎الدردشه المجهوله╎🚀⌋","id":".chathom"}' 
                   },
                   {
                      name: "quick_reply",
            buttonParamsJson: '{"SHADOW":"مطورين","LUFFY":".المطور"}'
                   },
                   {
                      name: "quick_reply",
            buttonParamsJson: '{"display_text":"معلومات البوت#","id":".معلومات-البوت"}'
                   },
                   {
             name: "cta_url",
             buttonParamsJson: '{"display_text":"⌈📲╎قـنـاة الـمـطـور╎📲⌋","url":"https://whatsapp.com/channel/0029Vag5dT01t90dVIah1X1p","merchant_url":"https://whatsapp.com/channel/0029Vag5dT01t90dVIah1X1p"}'
                          }
                      ]
                  }
              }
          }
      }
  }, {});
}

handler.help = ['info'];
handler.tags = ['main'];
handler.command = ['menu', 'مهام', 'اوامر','الاوامر','قائمة','القائمة']

export default handler;│
